## 🧾 Terraform Plan for `gov_audit`

> ⚠️ Review this carefully before applying changes

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gov_audit_advanced.aws_config_configuration_aggregator.org_aggregator[0] will be created
  + resource "aws_config_configuration_aggregator" "org_aggregator" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "org-aggregator"
      + tags_all = (known after apply)

      + organization_aggregation_source {
          + all_regions = true
          + role_arn    = "arn:aws:iam::123456789012:role/AggregatorRole"
        }
    }

  # module.gov_audit_advanced.aws_config_configuration_recorder.this[0] will be created
  + resource "aws_config_configuration_recorder" "this" {
      + id       = (known after apply)
      + name     = "config-recorder"
      + role_arn = "arn:aws:iam::123456789012:role/ConfigRecorderRole"

      + recording_group {
          + all_supported                 = true
          + include_global_resource_types = true
        }
    }

  # module.gov_audit_advanced.aws_config_configuration_recorder_status.this[0] will be created
  + resource "aws_config_configuration_recorder_status" "this" {
      + id         = (known after apply)
      + is_enabled = true
      + name       = "config-recorder"
    }

  # module.gov_audit_advanced.aws_config_delivery_channel.this[0] will be created
  + resource "aws_config_delivery_channel" "this" {
      + id             = (known after apply)
      + name           = "config-delivery-channel"
      + s3_bucket_name = "central-audit-logs"
    }

  # module.gov_audit_advanced.aws_guardduty_detector.this[0] will be created
  + resource "aws_guardduty_detector" "this" {
      + account_id                   = (known after apply)
      + arn                          = (known after apply)
      + enable                       = true
      + finding_publishing_frequency = (known after apply)
      + id                           = (known after apply)
      + tags_all                     = (known after apply)
    }

  # module.gov_audit_advanced.aws_guardduty_organization_admin_account.this[0] will be created
  + resource "aws_guardduty_organization_admin_account" "this" {
      + admin_account_id = "123456789012"
      + id               = (known after apply)
    }

  # module.gov_audit_advanced.aws_s3_bucket_lifecycle_configuration.log_lifecycle[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "log_lifecycle" {
      + bucket = "log-archive-bucket"
      + id     = (known after apply)

      + rule {
          + id     = "ArchiveConfigLogs"
          + status = "Enabled"

          + filter {
            }

          + transition {
              + days          = 30
              + storage_class = "GLACIER"
            }
        }
    }

  # module.gov_audit_advanced.aws_securityhub_account.this[0] will be created
  + resource "aws_securityhub_account" "this" {
      + arn                       = (known after apply)
      + auto_enable_controls      = true
      + control_finding_generator = "SECURITY_CONTROL"
      + enable_default_standards  = true
      + id                        = (known after apply)
    }

  # module.gov_audit_advanced.aws_securityhub_organization_admin_account.this[0] will be created
  + resource "aws_securityhub_organization_admin_account" "this" {
      + admin_account_id = "123456789012"
      + id               = (known after apply)
    }

  # module.gov_audit_advanced.aws_securityhub_standards_subscription.this["aws-foundational-security-best-practices"] will be created
  + resource "aws_securityhub_standards_subscription" "this" {
      + id            = (known after apply)
      + standards_arn = "arn:aws:securityhub:::ruleset/aws-foundational-security-best-practices/v/1.0.0"
    }

  # module.gov_audit_advanced.aws_securityhub_standards_subscription.this["cis-aws-foundations-benchmark"] will be created
  + resource "aws_securityhub_standards_subscription" "this" {
      + id            = (known after apply)
      + standards_arn = "arn:aws:securityhub:::ruleset/cis-aws-foundations-benchmark/v/1.0.0"
    }

  # module.gov_audit_advanced.aws_sns_topic_subscription.audit_notify[0] will be created
  + resource "aws_sns_topic_subscription" "audit_notify" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "compliance@example.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:us-east-1:123456789012:audit-topic"
    }

  # module.gov_audit_basic.aws_config_configuration_recorder.this[0] will be created
  + resource "aws_config_configuration_recorder" "this" {
      + id       = (known after apply)
      + name     = "config-recorder"
      + role_arn = "arn:aws:iam::123456789012:role/AWSConfigRole"

      + recording_group {
          + all_supported                 = true
          + include_global_resource_types = true
        }
    }

  # module.gov_audit_basic.aws_config_configuration_recorder_status.this[0] will be created
  + resource "aws_config_configuration_recorder_status" "this" {
      + id         = (known after apply)
      + is_enabled = true
      + name       = "config-recorder"
    }

  # module.gov_audit_basic.aws_config_delivery_channel.this[0] will be created
  + resource "aws_config_delivery_channel" "this" {
      + id             = (known after apply)
      + name           = "config-delivery-channel"
      + s3_bucket_name = "my-basic-audit-bucket"
    }

  # module.gov_audit_basic.aws_guardduty_detector.this[0] will be created
  + resource "aws_guardduty_detector" "this" {
      + account_id                   = (known after apply)
      + arn                          = (known after apply)
      + enable                       = true
      + finding_publishing_frequency = (known after apply)
      + id                           = (known after apply)
      + tags_all                     = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on providers.tf line 7, in provider "aws":
   7:   s3_force_path_style         = true

Use s3_use_path_style instead.

(and one more similar warning elsewhere)

Warning: Attribute Deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on providers.tf line 7, in provider "aws":
   7:   s3_force_path_style         = true

Use s3_use_path_style instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->